Show / Hide Table of Contents
Class ConcreteULSCheckResultShearEc2
ULS Check Shear Ec2
Inheritance
System.Object
ConcreteCheckResultBase
ConcreteULSCheckResultShear
ConcreteULSCheckResultShearEc2
Inherited Members
 ConcreteCheckResultBase.InternalFores
 ConcreteCheckResultBase.NonConformities
 ConcreteCheckResultBase.Result
 ConcreteCheckResultBase.CheckValue
 ConcreteCheckResultBase.LimitCheckValue
 ConcreteCheckResultBase.Check
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public class ConcreteULSCheckResultShearEc2 : ConcreteULSCheckResultShear
Properties
Improve this Doc   View Source
Ved
shear force
Declaration
public double Ved { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Vrd
decisive shear resistance
Declaration
public double Vrd { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Vrdc
shear resistance of concrete
Declaration
public double Vrdc { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Vrdmax
shear resistance of compression strut
Declaration
public double Vrdmax { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Vrdr
shear resistance
Declaration
public double Vrdr { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Vrds
shear resistance of shear reinforcement
Declaration
public double Vrds { get; set; }
Property Value
 Type |  Description
 System.Double
 Improve this Doc
 View Source